#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.fastly_tls_configuration.configuration: Reading...
data.fastly_tls_configuration.configuration: Read complete after 0s [id=MAaRB6MO1GLDYzPm9W3miQ]
data.aws_route53_zone.zone: Reading...
data.aws_route53_zone.zone: Read complete after 0s [id=Z032720523R36CX8M8EQU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.domain_validation[0] will be created
  + resource "aws_route53_record" "domain_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z032720523R36CX8M8EQU"
    }

  # aws_route53_record.records["stage.hkakehas.tokyo"] will be created
  + resource "aws_route53_record" "records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "stage.hkakehas.tokyo"
      + records         = [
          + "t.sni.global.fastly.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z032720523R36CX8M8EQU"
    }

  # fastly_tls_subscription.subscription will be created
  + resource "fastly_tls_subscription" "subscription" {
      + certificate_authority   = "lets-encrypt"
      + certificate_id          = (known after apply)
      + common_name             = (known after apply)
      + configuration_id        = "MAaRB6MO1GLDYzPm9W3miQ"
      + created_at              = (known after apply)
      + domains                 = [
          + "stage.hkakehas.tokyo",
        ]
      + force_destroy           = true
      + force_update            = false
      + id                      = (known after apply)
      + managed_dns_challenge   = (known after apply)
      + managed_dns_challenges  = (known after apply)
      + managed_http_challenges = (known after apply)
      + state                   = (known after apply)
      + updated_at              = (known after apply)
    }

  # fastly_tls_subscription_validation.validation will be created
  + resource "fastly_tls_subscription_validation" "validation" {
      + id              = (known after apply)
      + subscription_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cert_info = {
      + domains         = [
          + "stage.hkakehas.tokyo",
        ]
      + tls_config_name = "HTTP/3 & TLS v1.3 + 0RTT (t.sni)"
    }
  + dns_info  = {
      + "stage.hkakehas.tokyo" = {
          + alias                            = []
          + allow_overwrite                  = true
          + cidr_routing_policy              = []
          + failover_routing_policy          = []
          + geolocation_routing_policy       = []
          + geoproximity_routing_policy      = []
          + health_check_id                  = null
          + latency_routing_policy           = []
          + multivalue_answer_routing_policy = null
          + name                             = "stage.hkakehas.tokyo"
          + records                          = [
              + "t.sni.global.fastly.net",
            ]
          + set_identifier                   = null
          + ttl                              = 300
          + type                             = "CNAME"
          + weighted_routing_policy          = []
          + zone_id                          = "Z032720523R36CX8M8EQU"
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @hrmsk66, Action: `pull_request`, Working Directory: `cert/`, Workflow: `Deploy Cert`*